app/views/event_sessions/_form.html.erb

SELECT "users".* FROM "users"
---
		<%= f.label "Host" %>*
		<%= f.select :host_id, options_for_select(User.hosts), {prompt: "Please select"}, class: "form-control"%>