app/controllers/event_sessions_controller.rb

INSERT INTO "event_sessions" ("name", "description", "start_datetime", "end_datetime", "event_id", "created_at", "updated_at", "host_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @event_session = @event.event_sessions.new(event_session_params)
    if @event_session.save

UPDATE "event_sessions" SET "name" = $1, "description" = $2, "start_datetime" = $3, "end_datetime" = $4, "host_id" = $5, "updated_at" = $6 WHERE "event_sessions"."id" = $7
---
  def update
    if @event_session.update(event_session_params)

DELETE FROM "event_sessions" WHERE "event_sessions"."id" = $1  [["id", 1]]
---
  def destroy
    @event_session.destroy

SELECT "session_bookings".* FROM "session_bookings" WHERE "session_bookings"."event_session_id" = $1 AND "session_bookings"."host_id" = $2  [["event_session_id", 6], ["host_id", 2]]
---
  def view_attendees
    @attendees = SessionBooking.where(event_session_id: params[:event_session_id], host_id: current_user.id)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def set_event
    @event = Event.find(params[:event_id])

SELECT  "event_sessions".* FROM "event_sessions" WHERE "event_sessions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_event_session
    @event_session = EventSession.find(params[:id])