app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    @event.user_id = current_user.id

    if @event.save
---
INSERT INTO "events" ("name", "description", "start_datetime", "end_datetime", "entry_fee", "status", "user_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def show
    @event = Event.find(params[:id])
    @event_sessions = (current_user.is_host?) ? EventSession.host_sessions(current_user.id) : @event.event_sessions
    @session_booking = SessionBooking.new
    @session_bookings = SessionBooking.where(host_id: current_user.id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "session_bookings".* FROM "session_bookings" WHERE "session_bookings"."host_id" = $1  [["host_id", 2]]
SELECT "event_sessions".* FROM "event_sessions" WHERE "event_sessions"."host_id" = $1  [["host_id", 2]]

  def update
    if @event.update(event_params)
---
UPDATE "events" SET "name" = $1, "start_datetime" = $2, "end_datetime" = $3, "status" = $4, "updated_at" = $5 WHERE "events"."id" = $6  [["name", "Music1"], ["start_datetime", "2020-09-04 22:46:00"], ["end_datetime", "2020-09-04 22:46:00"], ["status", 0.0], ["updated_at", "2020-04-09 17:16:07.230411"], ["id", 1]]