app/controllers/session_bookings_controller.rb

INSERT INTO "session_bookings" ("event_session_id", "host_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["event_session_id", 6], ["host_id", 7], ["user_id", 5], ["created_at", "2020-04-09 09:10:47.309057"], ["updated_at", "2020-04-09 09:10:47.309057"]]
---
  def create
    @session_booking = SessionBooking.create(event_session_id: params[:event_session_id], host_id: @event_session.host_id, user_id: current_user.id)

SELECT  "session_bookings".* FROM "session_bookings" ORDER BY "session_bookings"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def approvals
    @session_bookings = SessionBooking.all

SELECT  "session_bookings".* FROM "session_bookings" WHERE "session_bookings"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "session_bookings" SET "status" = $1 WHERE "session_bookings"."id" = $2  [["status", "Approved"], ["id", 5]]
---
  def approve_or_reject
    @session_booking = SessionBooking.find(params[:id])
    @session_booking.update_column(:status, params[:commit] + "d")

SELECT  "event_sessions".* FROM "event_sessions" WHERE "event_sessions"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def set_session_booking
    @event_session = EventSession.find(params[:event_session_id])