app/models/event_session.rb

  def is_enrolled?(user)
  	SessionBooking.where(event_session_id: self.id, user_id: user.id).present?
---
SELECT "session_bookings".* FROM "session_bookings" WHERE "session_bookings"."event_session_id" = $1 AND "session_bookings"."user_id" = $2  [["event_session_id", 1], ["user_id", 1]]