app/models/session_booking.rb

  def update_status
  	self.update_attribute(:status, STATUSES[:pending])
---
UPDATE "session_bookings" SET "status" = $1, "updated_at" = $2 WHERE "session_bookings"."id" = $3  [["status", "Approved"], ["updated_at", "2020-04-09 09:10:47.383708"], ["id", 7]]

  def host
  	User.find(self.host_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]