app/models/user.rb

SELECT "roles"."name" FROM "roles" INNER JOIN "permissions" ON "roles"."id" = "permissions"."role_id" WHERE "permissions"."user_id" = $1  [["user_id", 7]]
---
  def role?(role)
  	self.roles.pluck(:name).include? role

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def self.hosts
  	User.all.collect { | user | [user.name, user.id] if user.role? "host"}.compact

INSERT INTO "permissions" ("user_id", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["role_id", 3], ["created_at", "2020-04-09 16:10:26.324311"], ["updated_at", "2020-04-09 16:10:26.324311"]]
SELECT  "roles".* FROM "roles" ORDER BY "roles"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def assign_user_role
  	Permission.create(user_id: self.id, role_id: Role.last.id)